In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  7  9  9  8
1  5  9  9  3  4
2  2  2  2  8  3
3  8  7  3  8  8
4  9  6  5  1  9
5  8  4  2  9  4
6  8  8  6  3  9
7  3  9  5  6  9
8  8  3  8  7  4
9  5  8  2  1  5

In [3]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
0  5  7  9  9  8
1  5  9  9  3  4
2  2  2  2  8  3
7  3  9  5  6  9
9  5  8  2  1  5

In [4]:
df[df['A'].between(2, 5, inclusive='left')]

   A  B  C  D  E
2  2  2  2  8  3
7  3  9  5  6  9

In [5]:
df[df['A'].between(2, 5, inclusive='right')]

   A  B  C  D  E
0  5  7  9  9  8
1  5  9  9  3  4
7  3  9  5  6  9
9  5  8  2  1  5

In [6]:
df[df['A'].between(2, 5, inclusive='both')]

   A  B  C  D  E
0  5  7  9  9  8
1  5  9  9  3  4
2  2  2  2  8  3
7  3  9  5  6  9
9  5  8  2  1  5

In [7]:

df[df['A'].between(2, 5, inclusive='neither')]

   A  B  C  D  E
7  3  9  5  6  9